
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 51 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_federated_identity_credential.pip_crime_federated_connection
* Update
  * azurerm_api_management_subscription.product[0]
  * azurerm_application_insights.java
  * azurerm_application_insights.nodejs
  * azurerm_automation_account.automation_account
  * azurerm_resource_group.rg
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_runbook.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;auto-pip-stg-courtel-api&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;courtel-certificate&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;gov-uk-notify-api-key&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;pip-team-email&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;apim-subscription-key&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_cp_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-V6-HOST&#34;]
  * module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-V6-PASSWORD&#34;]
  * module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-V6-PORT&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-ad-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-auth-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-admin-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-extension-app-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;cft-idam-client-secret&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-name&#34;]
  * module.kv.azurerm_key_vault.kv
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv.azurerm_user_assigned_identity.managed_identity[0]
  * module.kv_apim.azurerm_key_vault.kv
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_user_assigned_identity.managed_identity[0]
  * module.kv_cp.azurerm_key_vault.kv
  * module.kv_cp.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_cp.azurerm_user_assigned_identity.managed_identity[0]
  * module.kv_sdp.azurerm_key_vault.kv
  * module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_sdp.azurerm_user_assigned_identity.managed_identity[0]
  * module.redis-v6.azurerm_private_endpoint.this[0]
  * module.redis-v6.azurerm_redis_cache.redis
  * module.redis-v6.azurerm_resource_group.cache-resourcegroup[0]
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "apim_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-apim-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_cp_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_cp_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-cp-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_application_insights.java will be updated in-place
  ~ resource "azurerm_application_insights" "java" {
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights"
        name                                  = "pip-ss-stg-java-appinsights"
      ~ tags                                  = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_application_insights.nodejs will be updated in-place
  ~ resource "azurerm_application_insights" "nodejs" {
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights"
        name                                  = "pip-ss-stg-nodejs-appinsights"
      ~ tags                                  = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
      ~ tags                          = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_federated_identity_credential.pip_crime_federated_connection will be created
  + resource "azurerm_federated_identity_credential" "pip_crime_federated_connection" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://uksouth.oic.prod-aks.azure.com/e2995d11-9947-4e78-9de6-d44e0603518e/0ec7ffc9-214e-4316-a94f-00cc14dfd136/"
      + name                = "pip-stg-crime-federated-credential"
      + parent_id           = (known after apply)
      + resource_group_name = "pip-ss-stg-rg"
      + subject             = "system:serviceaccount:default:pip-cp-service-account"
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg"
        name     = "pip-ss-stg-rg"
      ~ tags     = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/e838c0ca-fbe8-4f68-a547-0f3426ec63dd" -> (known after apply)
      ~ job_schedule_id         = "e838c0ca-fbe8-4f68-a547-0f3426ec63dd" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/842ad216-3411-4342-b917-1b796065166f" -> (known after apply)
      ~ job_schedule_id         = "842ad216-3411-4342-b917-1b796065166f" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_runbook.client_serects will be updated in-place
  ~ resource "azurerm_automation_runbook" "client_serects" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/runbooks/secret-rotation-b2c-apps"
        name                     = "secret-rotation-b2c-apps"
      ~ tags                     = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2023-09-09T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2023-09-08T06:57:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["auto-pip-stg-courtel-api"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/auto-pip-stg-courtel-api/e9d2435f2023425ea9d17d0f2e0fb01f"
        name                    = "auto-pip-stg-courtel-api"
      ~ tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["courtel-certificate"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/courtel-certificate/488e716184b74444ba2804306b7322ed"
        name                    = "courtel-certificate"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["gov-uk-notify-api-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/gov-uk-notify-api-key/2cb2f56f5e1d4faf9782dfc728ff98fc"
        name                    = "gov-uk-notify-api-key"
      ~ tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["pip-team-email"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/pip-team-email/bcdf208071594844b54d4a3a0d154fd6"
        name                    = "pip-team-email"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["apim-subscription-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/apim-subscription-key/9dd7383fa5e84859b0ba09de2a1404e5"
        name                    = "apim-subscription-key"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/app-tenant-id/010d13fc42854dc5b551869c94d3f336"
        name                    = "app-tenant-id"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_cp_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-cp-kv-stg.vault.azure.net/secrets/app-tenant-id/639cab60cff948e79b4431632e45701b"
        name                    = "app-tenant-id"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret["REDIS-V6-HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-V6-HOST/e57c2c3ba80441d6a543944cf20f1d1c"
        name                    = "REDIS-V6-HOST"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret["REDIS-V6-PASSWORD"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-V6-PASSWORD/569cf825a7dc4da195fe825a8dbd103f"
        name                    = "REDIS-V6-PASSWORD"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_redis_v6_secrets.azurerm_key_vault_secret.secret["REDIS-V6-PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-V6-PORT/9a69756eeaf042f9b4d1dad74f84094e"
        name                    = "REDIS-V6-PORT"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-connection-string/0edecabab46243fe99bf0503fd4bb147"
        name                    = "app-insights-java-connection-string"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-instrumentation-key/d5ed46485fc24862ac8060acf4e5dda0"
        name                    = "app-insights-java-instrumentation-key"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-nodejs-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-nodejs-instrumentation-key/a5c761a9ef42455c9e1ce038fe0864df"
        name                    = "app-insights-nodejs-instrumentation-key"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-tenant-id/6e75884757794cc5b6739353b7f0499a"
        name                    = "app-tenant-id"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-ad-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-ad-url/393424f8773241fe98a1be70736818b9"
        name                    = "b2c-ad-url"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-auth-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-auth-endpoint/5a11d3a5a21f4285962e13216c4bb605"
        name                    = "b2c-auth-endpoint"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-admin-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-admin-endpoint/51386e906269465da6b4663bbc76a227"
        name                    = "b2c-config-admin-endpoint"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-endpoint/4b8816cc89174ea5a5340362d401419e"
        name                    = "b2c-config-endpoint"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-extension-app-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-extension-app-id/1f338cfb15a44dde8c9edceaf00405ae"
        name                    = "b2c-extension-app-id"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-tenant-id/0a88f286fefb4ecdb9134a323b7a55bc"
        name                    = "b2c-tenant-id"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-url/13887feb82b94246a9343877dacb52d6"
        name                    = "b2c-url"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["cft-idam-client-secret"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cft-idam-client-secret/76d5fa70c6da4ffba3f4830dada411d7"
        name                    = "cft-idam-client-secret"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/session-key/df7555bb08ef46f1a0872686c26d4d37"
        name                    = "session-key"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-key/2a694c11a4814948bf6f093be1a08933"
        name                    = "shared-storageaccount-key"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-name/c47855dfbfdf4acbb028628fc6cd6cd5"
        name                    = "shared-storageaccount-name"
      ~ tags                    = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.kv.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
        name                            = "pip-ss-kv-stg"
      ~ tags                            = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi"
        name                = "pip-stg-mi"
      ~ tags                = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.kv_apim.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg"
        name                            = "pip-ss-apim-kv-stg"
      ~ tags                            = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_apim.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi"
        name                = "pip-apim-stg-mi"
      ~ tags                = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.kv_cp.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-cp-kv-stg"
        name                            = "pip-ss-cp-kv-stg"
      ~ tags                            = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kv_cp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-cp-kv-stg|pip-ss-cp-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-cp-kv-stg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_cp.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-cp-stg-mi"
        name                = "pip-cp-stg-mi"
      ~ tags                = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.kv_sdp.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
        name                            = "pip-ss-sdp-kv-stg"
      ~ tags                            = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_sdp.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-sdp-stg-mi"
        name                = "pip-sdp-stg-mi"
      ~ tags                = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.redis-v6.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Network/privateEndpoints/pip-v6-stg"
        name                     = "pip-v6-stg"
      ~ tags                     = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Cache/Redis/pip-v6-stg"
        name                          = "pip-v6-stg"
      ~ tags                          = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redis-v6.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg"
        name     = "pip-v6-cache-stg"
      ~ tags     = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "storage-account-role-assignment" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg/providers/Microsoft.Authorization/roleAssignments/c6be6899-85a3-2479-1296-ab82922ceaa6" -> (known after apply)
      ~ name                             = "c6be6899-85a3-2479-1296-ab82922ceaa6" -> (known after apply)
      ~ principal_id                     = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
      ~ tags                              = {
          + "autoShutdown"        = "true"
            # (6 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 51 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"","Vars":{}} -->